{




"monsterD" :


[


"Dactyl (mythology) - Little people (mythology) and smith and healing spirits",
"Daemon (mythology) - Incorporeal spirit",
"Dahu (France, Switzerland and the north of Italy) - Like a deer or ibex with legs on one side of its body are shorter than on the other side",
"Daidarabotchi (Japanese mythology) - Giant responsible for creating many geographical features in Japan",
"Daitengu (Japanese mythology) - Most powerful class of tengu, each of whom lives on a separate mountain",
"Daitya (Hindu mythology) - Giant.",
"Danava (Hinduism) - Water demon.",
"Daphnaie (Greek mythology) - Laurel tree nymph.",
"Datsue-ba (Japanese mythology) - Old woman who steals clothes from the souls of the dead.",
"Dead Sea Apes (Islamic mythology) - Human tribe turned into apes for ignoring Moses' message.",
"Deer Woman (Native American mythology) - Human-deer hybrid.",
"Deity (Global) - Preternatural or supernatural possibly immortal being.",
"Demon (Global) - From the Greek ''daemon'', chthonic entities of Hell; the counterparts of Angels.",
"Demigod (Global) - Half human, half god.",
"Dhampir (Balkans) - Human/vampire hybrid.",
"Dilong (Chinese mythology) - Earth dragon.",
"Dip (Catalan myth) - Demonic and vampiric dog.",
"Di Penates (Roman mythology) - House spirit.",
"Dipsa (Bestiary) - Extremely venomous snake.",
"Dirawong (Australian Aboriginal mythology) - Goanna spirit.",
"Di sma undar jordi (Gotland) - Little people (mythology) and nature spirits.",
"Diwata (Philippine mythology) - Tree spirit.",
"Djall (Albanian mythology)- Devil",
"Dobhar-chu (Irish mythology) - King otter.",
"Do-gakw-ho-wad (Abenaki mythology) - Little people (mythology)",
"Dokkaebi (Korean mythology) - Grotesque, horned humanoids.",
"Dokkalfar (Norse mythology) - Male ancestral spirits; the Dark Elves.",
"Dola (mythology) - Tutelary and fate spirit.",
"Domovoi (Slavic mythology) - House spirit.",
"Doppelganger (German folklore) - Ghostly double.",
"Drac (Catalan myths and legends) - Lion or bull-faced dragon.",
"Drac (Mythology in France) - Winged sea serpent.",
"Dragons in Greek mythology (Greek mythology) - Greek dragons.",
"Drakaina (Greek) - Dragons depicted with female characteristics.",
"Dragon (Many cultures worldwide) - Fire-breathing and (normally) winged reptiles.",
"Dragon turtle (Chinese mythology) - Giant turtle with dragon-like head.",
"Drangue (Albanian mythology)- semi-human winged warriors",
"Draugr (Norse mythology) - Undead.",
"Drekavac (Slavic mythology) - Restless ghost of an unbaptised child.",
"Drop Bear (Australian folklore) Large carnivorous koala that hunts by dropping on its prey from trees.",
"Drude (German folklore) - Possessing demon.",
"Druk (Culture of Bhutan) - Dragon.",
"Dryad (Greek mythology) - Tree nymph.",
"Duende (mythology) - Little people (mythology) and forest spirits.",
"Duergar (folklore) - Malevolent Little people (mythology).",
"Dullahan (Irish folklore) - Headless death spirit.",
"Duwende (Philippine mythology) - Little people (mythology), some are house spirits, others nature spirits.",
"Dwarves (Norse mythology) - Subterranean Little people (mythology) smiths.",
"Dvorovoi (Slavic mythology) - Courtyard spirit.",
"Dwarf (mythology) - Little people (mythology) nature spirits.",
"Dybbuk (Jewish mythology) - Spirit (sometimes the soul of a wicked deceased) that possesses the living.",
"Dzee-dzee-bon-da (Abenaki mythology) - Hideous monster.",
"Dzunukwa (Kwakwaka'wakw mythology) - Child-eating hag."

]

}